<a href="https://colab.research.google.com/github/Riturajkumari/skills_basic_python/blob/main/pandas_2_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Q1. List any five functions of the pandas library with execution.**

Pandas functions in Python and methods that are essential for every Data Analyst and Data Scientist.

1. read_csv()
 read_csv() function helps read a comma-separated values (csv) file into a Pandas DataFrame
2. head()
 By default, df.head() will return the first 5 rows of the DataFrame.
3. Describe() # data.Describe()
describe() is used to generate descriptive statistics of the data in a Pandas DataFrame or Series.
4. astype()
5. loc[:]

In [ ]:
df= pd.read_csv("iris.csv")
df.head()

   sepallength  sepalwidth  petallength  petalwidth        class
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa

In [ ]:
df.describe()

       sepallength  sepalwidth  petallength  petalwidth
count   150.000000  150.000000   150.000000  150.000000
mean      5.843333    3.054000     3.758667    1.198667
std       0.828066    0.433594     1.764420    0.763161
min       4.300000    2.000000     1.000000    0.100000
25%       5.100000    2.800000     1.600000    0.300000
50%       5.800000    3.000000     4.350000    1.300000
75%       6.400000    3.300000     5.100000    1.800000
max       7.900000    4.400000     6.900000    2.500000

In [ ]:
df.loc[1]

sepallength            4.9
sepalwidth               3
petallength            1.4
petalwidth             0.2
class          Iris-setosa
Name: 1, dtype: object

**Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.**

In [ ]:
# import numpy and pandas module
import pandas as pd
import numpy as np

column=['A','B','C']
index=['d','e','f']

# create a dataframe of random values of array
df1 = pd.DataFrame(np.random.rand(3,3),columns=column, index=index)

print(df1)

print('\n\nDataframe after reindexing rows: \n',
df1.reindex(['d', 'e', 'f',]))

          A         B         C
d  0.819285  0.298049  0.091971
e  0.722276  0.508923  0.768664
f  0.960829  0.869882  0.292549


Dataframe after reindexing rows:
           A         B         C
d  0.819285  0.298049  0.091971
e  0.722276  0.508923  0.768664
f  0.960829  0.869882  0.292549

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [ ]:

val= [10,20,30,40,50]

In [ ]:
df = pd.DataFrame({'val': [10, 20 , 30, 40,50], 'condition': ['A', 'B', 'A', 'B','A']})
df

   val condition
0   10         A
1   20         B
2   30         A
3   40         B
4   50         A

In [ ]:
df.sum(axis = 0, skipna = True)

val            150
condition    ABABA
dtype: object

In [ ]:
# sum over the column axis.
df.sum(axis = 1, skipna = True)

0    10
1    20
2    30
3    40
4    50
dtype: int64

**Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.**

In [ ]:
# Import pandas package
import pandas as pd

# Define a dictionary containing Students data
data = {'text': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
'word_count': [5.1, 6.2, 5.1, 5.2]}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data)

In [ ]:
df

     text  word_count
0     Jai         5.1
1  Princi         6.2
2  Gaurav         5.1
3    Anuj         5.2

Q5. How are DataFrame.size() and DataFrame.shape() different?

- Syntax: dataframe.size
Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

- Syntax: dataframe.shape
Return : Returns tuple of shape (Rows, columns) of dataframe/series

In [ ]:
# importing pandas module
import pandas as pd

# making data frame
data = pd.read_csv("iris.csv")

# dataframe.size
size = data.size

# dataframe.shape
shape = data.shape

# printing size and shape
print("Size = {}\nShape ={}\nShape[0] x Shape[1] = {}".
format(size, shape, shape[0]*shape[1]))

Size = 750
Shape =(150, 5)
Shape[0] x Shape[1] = 750

Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel('test.xlsx', index_col=0)

  First Name  Last Name  Gender        Country  Age        Date    Id
0
1      Dulce      Abril  Female  United States   32  15/10/2017  1562
2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
3     Philip       Gent    Male         France   36  21/05/2015  2587
4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [ ]:
# Python3 code to demonstrate working of
# Extract domain name from Email address
# Using index() + slicing

# initializing strings
test_str = 'john.doe@example.com'

# printing original string
print("The original string is : " + str(test_str))

# slicing domain name using slicing
res = test_str[test_str.index('@') + 1 : ]

# printing result
print("The extracted domain name : " + str(res))

The original string is : john.doe@example.com
The extracted domain name : example.com

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

  A B C
  
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [ ]:
# Define a dictionary containing Students data
data = {'A': [3,8,6,2,9],
        'B':[5,2,9,3,1],
        'C':[1,7,4,5,2]}

{'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]}

In [ ]:
df= pd.DataFrame(data)

In [ ]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [ ]:
df['A']>5

0    False
1     True
2     True
3    False
4     True
Name: A, dtype: bool

In [ ]:
df['B']<10

0    True
1    True
2    True
3    True
4    True
Name: B, dtype: bool

In [ ]:
Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [ ]:
df[1:2]

   A  B  C
1  8  2  7

In [ ]:
df.loc[1:1]

   A  B  C
1  8  2  7

In [ ]:
df[4:5]

   A  B  C
4  9  1  2

In [ ]:
df.loc[4:4]

   A  B  C
4  9  1  2

**Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.**

In [ ]:
# importing the module
import pandas as pd

# creating a series
vol = pd.Series(data = [10,20,30,40,50])

# displaying the series
print(vol)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
# finding the mean
print(vol.mean())

30.0

In [ ]:
# finding the Standard deviation
print(vol.median())

30.0

In [ ]:
## finding the Standard deviation
print(vol.std())

15.811388300841896

**Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.**

In [ ]:
# importing pandas as pd
import pandas as pd

# Creating the DataFrame
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011','14/2/2011','15/2/2011','16/2/2011'],
					'Sales':[10,20,30,40,50,10,20]})
				
# Print the dataframe
print(df)

        Date  Sales
0  10/2/2011     10
1  11/2/2011     20
2  12/2/2011     30
3  13/2/2011     40
4  14/2/2011     50
5  15/2/2011     10
6  16/2/2011     20

In [ ]:

# create a new column
df['MovingAverage'] = df['Sales'] - (0.1 * df['Sales'])

# Print the DataFrame after
# addition of new column
print(df)

        Date  Sales  MovingAverage
0  10/2/2011     10            9.0
1  11/2/2011     20           18.0
2  12/2/2011     30           27.0
3  13/2/2011     40           36.0
4  14/2/2011     50           45.0
5  15/2/2011     10            9.0
6  16/2/2011     20           18.0

**Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.**

For example, if df contains the following values:

Date

0 2023-01-01

1 2023-01-02

2 2023-01-03

3 2023-01-04

4 2023-01-05

Your function should create the following DataFrame:

Date Weekday

0 2023-01-01 Sunday

1 2023-01-02 Monday

2 2023-01-03 Tuesday

3 2023-01-04 Wednesday

4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [ ]:
Dates=['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']
Dates

['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']

In [ ]:
data=pd.DataFrame(Dates)
data

            0
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [ ]:
data = {
    "Date": ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']}
    
# create dataframe from data dictionary
df = pd.DataFrame(data)
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [ ]:
  
# Provide 'Address' as the column name
df['Date_Weekday'] = Date_Weekday
df

         Date Date_Weekday
0  2023-01-01       sunday
1  2023-01-02       monday
2  2023-01-03      tuesday
3  2023-01-04    wednesday
4  2023-01-05     thursday

:**Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.**

In [50]:
import pandas as pd

# Create dates dataframe with frequency
data = pd.date_range('1/1/2023', periods = 10, freq ='H')

data

DatetimeIndex(['2023-01-01 00:00:00', '2023-01-01 01:00:00',
               '2023-01-01 02:00:00', '2023-01-01 03:00:00',
               '2023-01-01 04:00:00', '2023-01-01 05:00:00',
               '2023-01-01 06:00:00', '2023-01-01 07:00:00',
               '2023-01-01 08:00:00', '2023-01-01 09:00:00'],
              dtype='datetime64[ns]', freq='H')

In [51]:
# Create date and time with dataframe
data = pd.date_range('1/1/2023', periods = 10, freq ='H')

x = pd.datetime.now()
x.month, x.year

<ipython-input-51-157a26917527>:4: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  x = pd.datetime.now()

(2, 2023)

In [52]:
# Create date and time with dataframe
rng = pd.DataFrame()
rng['date'] = pd.date_range('1/1/2023', periods = 72, freq ='H')

# Print the dates in dd-mm-yy format
rng[:5]

# Create features for year, month, day, hour, and minute
rng['year'] = rng['date'].dt.year
rng['month'] = rng['date'].dt.month
rng['day'] = rng['date'].dt.day
rng['hour'] = rng['date'].dt.hour
rng['minute'] = rng['date'].dt.minute

# Print the dates divided into features
rng.head(3)

                 date  year  month  day  hour  minute
0 2023-01-01 00:00:00  2023      1    1     0       0
1 2023-01-01 01:00:00  2023      1    1     1       0
2 2023-01-01 02:00:00  2023      1    1     2       0

**Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?**

**Five basic Pandas functions You should be using**
- Import the library
- Open the file
- Visualize de data
- Show information
- Describe the data
- Split the data

In [ ]:
# import the library

In [35]:
from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

In [38]:
# open the file
data= pd.read_csv("/content/drive/MyDrive/train.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [40]:
# Visualize de data
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
#show information  the data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [44]:
#Describe the data
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [46]:
data["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64